
## Plan Result (prod_twingate)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 6 to add, 0 to change, 5 to destroy.</code></pre>

* Create
  * time_rotating.service_account_key_rotation
* Replace
  * azurerm_key_vault_secret.service_account_key[&#34;AzureDevOps&#34;]
  * azurerm_key_vault_secret.service_account_key[&#34;Pterodactyl&#34;]
  * time_static.service_account_key_rotation


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.service_account_key["AzureDevOps"] must be replaced
-/+ resource "azurerm_key_vault_secret" "service_account_key" {
      ~ expiration_date         = "2025-02-23T20:14:15Z" -> (known after apply) # forces replacement
      ~ id                      = "https://bancey-vault.vault.azure.net/secrets/Twingate-AzureDevOps-SA-Key/4c938ba82b554f8ea889f4678d8c8034" -> (known after apply)
        name                    = "Twingate-AzureDevOps-SA-Key"
      ~ resource_id             = "/subscriptions/5a8abf1c-0a69-49c6-bcf1-676843b64217/resourceGroups/common/providers/Microsoft.KeyVault/vaults/bancey-vault/secrets/Twingate-AzureDevOps-SA-Key/versions/4c938ba82b554f8ea889f4678d8c8034" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/5a8abf1c-0a69-49c6-bcf1-676843b64217/resourceGroups/common/providers/Microsoft.KeyVault/vaults/bancey-vault/secrets/Twingate-AzureDevOps-SA-Key" -> (known after apply)
      - tags                    = {} -> null
      ~ value                   = (sensitive value)
      ~ version                 = "4c938ba82b554f8ea889f4678d8c8034" -> (known after apply)
      ~ versionless_id          = "https://bancey-vault.vault.azure.net/secrets/Twingate-AzureDevOps-SA-Key" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.service_account_key["Pterodactyl"] must be replaced
-/+ resource "azurerm_key_vault_secret" "service_account_key" {
      ~ expiration_date         = "2025-02-23T20:14:15Z" -> (known after apply) # forces replacement
      ~ id                      = "https://bancey-vault.vault.azure.net/secrets/Twingate-Pterodactyl-SA-Key/23e101628cd14a4fafc22991c263143a" -> (known after apply)
        name                    = "Twingate-Pterodactyl-SA-Key"
      ~ resource_id             = "/subscriptions/5a8abf1c-0a69-49c6-bcf1-676843b64217/resourceGroups/common/providers/Microsoft.KeyVault/vaults/bancey-vault/secrets/Twingate-Pterodactyl-SA-Key/versions/23e101628cd14a4fafc22991c263143a" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/5a8abf1c-0a69-49c6-bcf1-676843b64217/resourceGroups/common/providers/Microsoft.KeyVault/vaults/bancey-vault/secrets/Twingate-Pterodactyl-SA-Key" -> (known after apply)
      - tags                    = {} -> null
      ~ value                   = (sensitive value)
      ~ version                 = "23e101628cd14a4fafc22991c263143a" -> (known after apply)
      ~ versionless_id          = "https://bancey-vault.vault.azure.net/secrets/Twingate-Pterodactyl-SA-Key" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # time_rotating.service_account_key_rotation will be created
  + resource "time_rotating" "service_account_key_rotation" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 7
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # time_static.service_account_key_rotation must be replaced
-/+ resource "time_static" "service_account_key_rotation" {
      ~ day     = 23 -> (known after apply)
      ~ hour    = 20 -> (known after apply)
      ~ id      = "2025-02-23T20:14:15Z" -> (known after apply)
      ~ minute  = 14 -> (known after apply)
      ~ month   = 2 -> (known after apply)
      ~ rfc3339 = "2025-02-23T20:14:15Z" -> (known after apply) # forces replacement
      ~ second  = 15 -> (known after apply)
      ~ unix    = 1740341655 -> (known after apply)
      ~ year    = 2025 -> (known after apply)
    }

  # twingate_service_account_key.this["AzureDevOps"] will be replaced due to changes in replace_triggered_by
-/+ resource "twingate_service_account_key" "this" {
      ~ id                 = "U2VydmljZUFjY291bnRLZXk6N0YyTk05bU9wcFN3cExvdzdDTUlhWjVVeFhuaHh2c04wdDZaclNzMWtnRQ==" -> (known after apply)
      ~ is_active          = true -> (known after apply)
        name               = "AzureDevOps Key (auto rotates)"
      ~ token              = (sensitive value)
        # (2 unchanged attributes hidden)
    }

  # twingate_service_account_key.this["Pterodactyl"] will be replaced due to changes in replace_triggered_by
-/+ resource "twingate_service_account_key" "this" {
      ~ id                 = "U2VydmljZUFjY291bnRLZXk6R2JNbGtzNnk0SmZtX3piYng0TlVRc2NTQ2hTQ1dPY2tFUHpOYzdnamtUbw==" -> (known after apply)
      ~ is_active          = true -> (known after apply)
        name               = "Pterodactyl Key (auto rotates)"
      ~ token              = (sensitive value)
        # (2 unchanged attributes hidden)
    }

Plan: 6 to add, 0 to change, 5 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # time_rotating.service_account_key_rotation has been deleted
  - resource "time_rotating" "service_account_key_rotation" {
        id               = "2025-02-23T20:14:15Z"
      - rfc3339          = "2025-02-23T20:14:15Z" -> null
        # (9 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":489,"Program":"tfcmt","SHA1":"","Target":"prod_twingate","Vars":{}} -->